{
    "theory": [
        {
            "tag": 1,
            "title": "Definition of Inheritance Law",
            "content": "The Definition",
            "subContent": "Inheritance law refers to the set of rules and principles that determine the distribution of a deceased person's estate among their heirs. It encompasses the legal processes involved in the transfer of assets and liabilities from the deceased to their beneficiaries."
        },
        {
            "tag": 1,
            "title": "Definition of Inheritance Law",
            "content": "The Importance",
            "subContent": "The principles of inheritance law ensure that the assets of the deceased are distributed fairly and in accordance with legal statutes and religious guidelines, providing a structured approach to asset allocation among heirs."
        },
        {
            "tag": 2,
            "title": "Rights Related to Inherited Property",
            "content": "Rights of Heirs",
            "subContent": "Rights related to inherited property include: \n➥ Funeral Arrangement: \n➟➟ From bathing, shrouding, and digging the grave, and this is given priority over other things according to the Hanbali school of thought. \n➥ Debt: \n➟➟ Debt related to the estate's assets:\n➟➟➟ Like debts with a specific time frame, and this is prioritized in the schools of Abu Hanifah, Malik, and Shafi'i over the management of the deceased.\n➟➟ Debt related to the responsibilities of the deceased:\n➟➟➟The deceased's debt in an absolute sense, whether it is a religious debt such as for Hajj, vows, and so on, or a debt owed to other people.\n➥ Testament:\n➟➟ Up to one-third (1/3) or less can be given to non-heirs, as the Prophet ﷺ said to Sa'ad ibn Abi Waqqas: \"One-third is sufficient, and one-third is already a lot.\" (Reported by Al-Bukhari in the Book of Bequests).\n➥ Inheritance:\n➟➟ With fixed shares (fardh) or residuary shares (ta'shib), based on the saying of the Prophet ﷺ: \"Give the shares of inheritance to those who are entitled to them, and the remainder to the closest male relative.\" (Muttafaqun 'Alaih)."
        },
        {
            "tag": 2,
            "title": "Rights Related to Inherited Property",
            "content": "Protection of Heirs' Rights",
            "subContent": "Heirs' rights to inherited property are protected by law, ensuring the proper distribution of assets and preventing disputes among beneficiaries."
        },
        {
            "tag": 3,
            "title": "Pillars of Inheritance",
            "content": "The Pillars",
            "subContent": "The pillars of inheritance are fundamental elements required for the proper execution of inheritance law. These pillars include: \n➥ The deceased (Al-Muwarrits)\n➥ The heir (Al-Warits)\n➥ The inherited property (Al-Mauruts)"
        },
        {
            "tag": 3,
            "title": "Pillars of Inheritance",
            "content": "Conditions for Inheritance",
            "subContent": "➥ The deceased must be confirmed dead.\n➥ The heir must be alive at the time of the deceased's death.\n➥ There must be an estate to be inherited for the inheritance process to proceed."
        },
        {
            "tag": 4,
            "title": "Conditions of Inheritance",
            "content": "The Conditions",
            "subContent": "A condition is something that, if absent, necessitates the absence of what it conditions. However, the presence of the condition does not necessitate the presence or absence of what it conditions. For example: Wudu (ablution) is a condition for the validity of Salah (prayer); if Wudu is absent, then Salah cannot exist (the prayer will not be valid). However, the presence of Wudu does not necessitate the performance of Salah."
        },
        {
            "tag": 4,
            "title": "Conditions of Inheritance",
            "content": "Specific Conditions",
            "subContent": "Conditions include: \n➥ Certainty of the death of the heir (al-muwarrits) can be established through actual death, such as witnessing it directly, through testimony, or through legal judgment, such as being declared legally dead like a missing person.\n➥ Certainty of the existence of the heir's life at the time of the deceased's death, even if only momentarily, such as a baby being born alive then passing away, is essential. \n➥ Knowing the reason for inheriting includes understanding who will inherit and who is prevented from inheriting, as well as knowing the close and distant relatives of the deceased."
        },
        {
            "tag": 5,
            "title": "Causes of Inheritance",
            "content": "The Causes",
            "subContent": "A cause is something that, if present, necessitates the presence of something else, and conversely, if absent, necessitates the absence of something else. \n\nFor example, the arrival of the month of Ramadan is the cause for the obligation to fast; if Ramadan has not arrived, then there is no obligation to fast."
        },
        {
            "tag": 5,
            "title": "Causes of Inheritance",
            "content": "Types of Causes",
            "subContent": "➥ Blood relations (Nasab): \n➟➟ An-Nasab, or the system of lineage in Islamic inheritance law, is divided into three categories: \n➟➟➟ Al-Ushul (Roots): This includes the direct ancestors such as the father, paternal grandfather, mother, and maternal grandmother, and so on. \n➟➟➟ Al-Furu' (Branches): This encompasses the descendants such as sons, daughters, grandsons, granddaughters, and so forth. \n➟➟➟ Al-Hawasyi (Sidelines): This covers collateral relatives like full siblings, half-siblings, maternal siblings, nieces, paternal uncles, maternal uncles, and cousins. \n➥ Marital bonds (Nikah) \n➟➟ A valid marriage contract even if physical intimacy or seclusion (khalwat) does not occur. \n➥ The freeing of a slave (Wala') \n➟➟ 'Ushubah (residuary inheritance) occurs due to the favor given by a mu'tiq (a person who frees a slave) to the slave they emancipated. \n\nThese are the primary causes that establish an heir's right to inherit."
        },
        {
            "tag": 6,
            "title": "Barriers to Inheritance",
            "content": "The Barriers",
            "subContent": "A barrier is something that, if present, necessitates the absence of something else, but its absence does not necessitate the presence or absence of something else. \n\nFor example, menstruation is a barrier to prayer; if menstruation is present, it necessitates the absence of prayer, but the absence of menstruation does not necessitate the presence or absence of prayer."
        },
        {
            "tag": 6,
            "title": "Barriers to Inheritance",
            "content": "Specific Barriers",
            "subContent": "\n➥ Murder: A murderer cannot inherit from the person they killed. \n➥ Differences in religion: A non-Muslim cannot inherit from a Muslim, and vice versa. \n➥ Slavery: A slave does not receive inheritance and cannot inherit."
        },
        {
            "tag": 7,
            "title": "Male Heirs",
            "content": "Definition of Male Heirs",
            "subContent": "Male heirs are those male relatives of the deceased who are eligible to inherit. These include: \n➥ Sons\n➥ Grandsons\n➥ Fathers\n➥ Grandfathers\n➥ Brothers\n➥ Paternal Half-Brothers\n➥ Maternal Half-Brothers\n➥ Sons of Brother\n➥ Sons of Paternal Half-Brother\n➥ Uncles\n➥ Paternal Uncles\n➥ Sons of Uncles\n➥ Sons of Paternal Uncle\n➥ Husband\n➥ Male Slave Emancipator"
        },
        {
            "tag": 7,
            "title": "Male Heirs",
            "content": "Types of Male Heirs",
            "subContent": "Male heirs generally receive a specified portion of the estate, with priority given to closer relatives in accordance with inheritance laws."
        },
        {
            "tag": 8,
            "title": "Female Heirs",
            "content": "Definition of Female Heirs",
            "subContent": "Female heirs are those female relatives of the deceased who are eligible to inherit. These include: \n➥ Daughters\n➥ Granddaughters\n➥ Mothers\n➥ Grandmothers\n➥ Sisters \n➥ Paternal Half-Sisters\n➥ Maternal Half-Sisters\n➥ Wives\n➥ Female Slave Emancipator"
        },
        {
            "tag": 8,
            "title": "Female Heirs",
            "content": "Types of Female Heirs",
            "subContent": "Female heirs receive a specified portion of the estate, ensuring fair distribution and consideration of their rights within the inheritance framework."
        },
        {
            "tag": 9,
            "title": "How to Calculate Inheritance",
            "content": "Steps in Calculating Inheritance",
            "subContent": "Steps related to the estate of someone who has passed away are as follows:\n1- Handling the deceased's funeral.\n2- Paying off their debts.\n3- Carrying out their will (if any). \n4- Distributing the inheritance among the heirs.\n\nAs for the steps in dividing the inheritance, they are as follows:\n1- Gathering all heirs, both male and female.\n2- Determining each heir's share based on fard (fixed shares) or ta'shib (residual shares).\n3- Identifying the main issues or assets.\n4- Allocating shares to each heir from the main assets.\n5- Distributing the inheritance to each heir."
        },
        {
            "tag": 9,
            "title": "How to Calculate Inheritance",
            "content": "Factors in Calculation",
            "subContent": "The calculation process takes into account the type and value of: \n➥ The properties\n➥ The number of heirs\n➥ Their respective entitlements as defined by inheritance laws"
        },
        {
            "tag": 9,
            "title": "How to Calculate Inheritance",
            "content": "Example Calculation",
            "subContent": "If a man dies leaving behind \n➥ A wife, \n➥ A son, and \n➥A daughter. \n\nThe wife's share is 1/8 of the estate. The remainder is divided between the son and daughter, with the son receiving twice the share of the daughter. If the estate is worth IDR 800,000,000, \n➥ The wife's share is IDR 100,000,000, leaving IDR 700,000,000 to be divided. \n➥ The son receives IDR 466,667,000 and \n➥ The daughter receives IDR 233,333,333."
        },
        {
            "tag": 10,
            "title": "At-Ta'shib",
            "content": "Definition of At-Ta'shib",
            "subContent": "At-Ta'shib refers to a category of heirs who inherit the remaining estate after the fixed shares have been distributed to the primary heirs."
        },
        {
            "tag": 10,
            "title": "At-Ta'shib",
            "content": "Type of At-Ta'shib",
            "subContent": "➥ Ashabah bin Nafs (Residuary by Blood): All male heirs are considered ashabah, except for the husband and brothers from the same mother. These two are considered ashabul furudh. As for female heirs, only mu'tiqah (a woman who emancipated a slave) is considered. Their number can exceed 14 individuals.\n➥ Ashabah bil Ghair (Residuary by Cause): \n➟➟ A daughter with one or more siblings becomes an ashabah, along with a son with one or more siblings. \n➟➟ A granddaughter with one or more siblings becomes an ashabah, along with a grandson with one or more siblings. \n➟➟➟ A sister with one or more siblings sometimes becomes an ashabah, along with a full brother with one or more siblings. \n➟➟➟ A maternal half-sister with one or more siblings becomes an ashabah, along with a maternal half-brother with one or more siblings. \n➥ Ashabah ma'al Ghair (Residuary by Others): A sister with one or more siblings or a maternal half-sister with one or more siblings, when they are together with one or more daughters or one or more granddaughters, becomes an ashabah ma'al ghair based on the hadith of Ibn Mas'ud that has been mentioned previously."
        },
        {
            "tag": 10,
            "title": "At-Ta'shib",
            "content": "Example of At-Ta'shib",
            "subContent": "These heirs, typically male relatives, receive the residual estate in accordance with their priority and proximity to the deceased. \n\nFor instance, if after distributing the fixed shares there is IDR 100,000 remaining, this amount is given to the nearest male relative."
        },
        {
            "tag": 11,
            "title": "Al-Hajb",
            "content": "Definition of Al-Hajb",
            "subContent": "Al-Hajb refers to the exclusion of certain heirs from inheriting due to the presence of closer or more entitled relatives."
        },
        {
            "tag": 11,
            "title": "Al-Hajb",
            "content": "Type of Al-Hajb",
            "subContent": "➥ Hajb bisy Syakhs (Obstacle to Inheritance with People): \n➟➟➟ Hirman (The entirety): Like a son obstructing a grandson, a father obstructing a grandfather, and a mother obstructing a grandmother. \n➟➟➟ Nuqshan (Some): Like the transfer of the husband's share when there is a father or a grandson from 1/2 to 1/4, the transfer of the wife's share with a child or grandchild from 1/4 to 1/8, and the transfer of the mother's share with a child or grandchild or with plural siblings from 1/3 to 1/6. \n➥ Hajb bi Wajb (Obstacle to Inheritance with Characteristics): If an heir possesses a characteristic that is one of the obstacles to inheritance (such as slavery, murder, or difference in religion). Then they are prevented from receiving the inheritance due to the obstacle within themselves, and they do not affect the inheritance of other heirs, therefore their presence is as if they were not there."
        },
        {
            "tag": 11,
            "title": "Al-Hajb",
            "content": "Example of Al-Hajb",
            "subContent": "This concept ensures that only those heirs with the closest relationship to the deceased receive their due share of the estate. \n\nFor example, a brother is excluded from inheriting if the deceased has a son."
        },
        {
            "tag": 12,
            "title": "Al-'Aul",
            "content": "Definition of Al-'Aul",
            "subContent": "Al-'Aul is a concept in inheritance law where the shares of the estate are proportionally reduced when the total allocated shares exceed the available estate. This refers to an increase in the principal issue and a decrease in the share of each heir. The reason is the presence of many ashabul furudh (primary heirs) in one inheritance. The first case of aul occurred during the time of 'Umar (may Allah be pleased with him), involving a husband, full sister, and mother. 'Umar gathered the companions for consultation, and he followed the opinion of 'Abbas (may Allah be pleased with him)."
        },
        {
            "tag": 12,
            "title": "Al-'Aul",
            "content": "Example Calculation of Al-'Aul",
            "subContent": "If the total shares allocated to the heirs exceed the estate, each share is proportionally reduced. If an estate is worth IDR 600,000,000 and the shares exceed this amount by 20%, each share is reduced by 20%. Thus, if an heir was to receive IDR 100,000,000, they now receive IDR 80,000,000."
        },
        {
            "tag": 13,
            "title": "Ar-Radd",
            "content": "Definition of Ar-Radd",
            "subContent": "Ar-Radd refers to the redistribution of the remaining estate to the primary heirs when there are no eligible secondary heirs (At-Ta'shib). This refers to a reduction in the principal issue and an increase in the share of each primary heir ('ashabul furudh). Radd is the opinion of the majority of scholars (madhhab jumhur), different from the Maliki madhhab, where they allocate the remainder to the Baitul Mal (public treasury). However, husbands and wives are not considered ashl radd according to the strong opinion because they are not relatives of the deceased."
        },
        {
            "tag": 13,
            "title": "Ar-Radd",
            "content": "Example of Ar-Radd",
            "subContent": "This process ensures that the entire estate is allocated among the primary heirs, preventing any portion from remaining undistributed. \n\nFor example, if an estate of IDR 500,000,000 is initially divided with some shares remaining, those shares are redistributed among the primary heirs."
        },
        {
            "tag": 14,
            "title": "Al-Munasakhat",
            "content": "Definition of Al-Munasakhat",
            "subContent": "➥ Linguistically, it means to lift (remove) and transfer, which refers to the issue of a deceased person removing the issue of the first deceased person, and the issue of the third deceased person removing the issue of the second deceased person. \n\n➥In technical terms, it refers to the death of one or more heirs before the division of the inheritance, resulting in their share (from the deceased) being transferred to their heirs."
        },
        {
            "tag": 14,
            "title": "Al-Munasakhat",
            "content": "Example of Al-Munasakhat",
            "subContent": "This concept addresses the distribution of estates when the initial heir also dies before the estate is fully distributed, necessitating a re-evaluation of shares. \n\nFor instance, if a father and son die in quick succession, the father's estate is distributed first, followed by a re-distribution including the son's estate."
        },
        {
            "tag": 15,
            "title": "Inheritance of Al-Khuntsa Musykil (Intersex)",
            "content": "Definition of Al-Khuntsa Musykil",
            "subContent": "1. Clarity of status is hoped for.\n➥ 2. Clarity of status is not possible, such as if the person died when they were still young, or if their condition is unclear even in adulthood.\n\nIndicators of clarity of Khuntsa Al Musykil's status:\n➥1. Urination.\n➟➟➟ If they urinate from the male genitals, then they are considered male, and if they urinate from the female genitals, then they are considered female, because the genital organ that expels urine is the original genital organ. If they urinate from both, then the ruling is based on which one expelled urine first. If they expelled urine simultaneously, then it is based on which one expelled a larger volume of urine. If the volumes are the same, then they are still considered Khuntsa Al Musykil.\n➥ 2. Signs at puberty.\n➟➟➟ - Specific signs for males include the growth of facial hair and the emission of semen from their male genitals.\n➟➟➟ - Specific signs for females include menstruation, pregnancy, and the growth of breasts."
        },          
        {
            "tag": 15,
            "title": "Inheritance of Al-Khuntsa Musykil (Intersex)",
            "content": "Example of Al-Khuntsa Musykil",
            "subContent": "Specific guidelines ensure that intersex individuals receive a fair share of the estate based on their legal and recognized gender identity. \n\nFor example, if an intersex individual is legally recognized as male, they inherit according to male inheritance laws."
        },
        {
            "tag": 16,
            "title": "Inheritance of Al-Mafqud (Missing Person)",
            "content": "Definition of Al-Mafqud",
            "subContent": "Al Mafqud refers to a person whose whereabouts are unknown, and their condition is unclear whether they are still alive or have passed away.\n\nWhen there is doubt about the status of a missing person, whether they are alive or deceased, there are specific laws applicable to each situation, including laws related to their spouse's status, inheritance laws from others, and inheritance laws regarding them. Therefore, we must determine a waiting period until the missing person is declared deceased.\n\nThe determination of this waiting period is subject to ijtihad (legal reasoning) and the judge's opinion because the default ruling for a missing person is that they are alive and not considered deceased unless there is conviction or certainty of their death. The judge's ruling varies based on individual circumstances, place, and time.\n\nIf the deceased (muwarrits) or the person leaving inheritance for the missing person passes away, how should the inheritance be distributed among other heirs during the waiting period?\n\nThis situation is divided into 2 conditions:\n\n1. There are no other heirs besides the missing person, in which case all assets are held until their status becomes clear or the waiting period elapses.➥2. There are other heirs besides the missing person, in which case we allocate the smallest portion to each heir from the two conditions of the missing person, whether they are alive or deceased. The remainder is kept until their status becomes clear or the waiting period elapses.\n\nIf the waiting period has passed and the status remains unclear, what should be done with their assets and the assets held for them by their deceased?\n\n- The assets owned by the missing person are distributed to their living heirs when they are declared deceased, excluding those who have already passed away during the waiting period.➥- The assets held for them by their deceased are divided into 5 conditions:\n\n1. If it is known that the missing person is alive when their deceased passes away, the saved assets are given to them upon their return or to their heirs when they are declared deceased.➥2. If it is known that the missing person passed away after their deceased, the saved assets are given to their heirs.➥3. If it is known that the missing person passed away before their deceased, the saved assets are given to the heirs of the first deceased, and the heirs of the missing person receive nothing.➥4. If it is unknown whether the missing person is alive or deceased when their deceased passes away, the saved assets belong to the missing person and are later given to their heirs when they are declared deceased because the default ruling for a missing person is that they are alive and not considered deceased unless they are declared so.➥5. If their death is confirmed but it is unknown whether they passed away before or after their deceased, this condition falls under the topic of mass death inheritance, which will be discussed in the future."
        },
        {
            "tag": 16,
            "title": "Inheritance of Al-Mafqud (Missing Person)",
            "content": "Example of Al-Mafqud",
            "subContent": "Legal provisions dictate the handling of such cases, ensuring that the estate is distributed fairly while considering the possibility of the missing person's return. \n\nFor example, if an heir is declared missing, their share may be held in trust until their status is confirmed."
        },
        {
            "tag": 17,
            "title": "Inheritance of Al-Haml (Unborn Child)",
            "content": "Definition of Al-Haml",
            "subContent": "Al-Haml refers to a child conceived by a woman from the descendants of Adam, and the woman carries the child during the death of the deceased (al muwarrits). This child can inherit and potentially impede others in full or in part if born alive.]\n1\nThe Prophet ﷺ said:\n\"When a child is born crying, they inherit.\"\n[Conditions for the fetus to inherit:\n1. Certainty of their existence in the mother's womb at the time of the deceased's death, even if in the form of semen.\n2. The child is born from the mother's womb in a stable living condition, as mentioned in the hadith that has been narrated.\nThe condition of the fetus after the death of the deceased is assessed based on the duration of pregnancy, divided into 3:\n1. If born before the shortest duration of pregnancy (which is 6 months according to the agreement of scholars), then they inherit unconditionally.\n2. If born after the longest duration of pregnancy (which is 4 years according to the majority of scholars), then they do not inherit unconditionally.\n3. If born between the shortest and longest duration of pregnancy, this condition is divided into 2:\n- If the husband was capable of having intercourse with his wife, then the child does not inherit because there is no certainty of their existence in the mother's womb at the time of the deceased's death.\n- If the husband was incapable due to travel, lack of desire, or inability, then the child inherits.\nThe condition of the fetus after the death of the deceased is assessed based on their condition at birth, divided into 3:\n1. If born deceased, they do not inherit according to the consensus of scholars due to the possibility of their death before the deceased.\n2. If partially born alive but then dies before fully emerging, they do not inherit.\n3. If born alive, they inherit.]"
        },
        {
            "tag": 17,
            "title": "Inheritance of Al-Haml (Unborn Child)",
            "content": "Example of Al-Haml",
            "subContent": "The estate is reserved or partially distributed to accommodate the potential inheritance rights of the unborn child upon birth. \n\nFor example, if an estate is worth IDR 300,000,000 and an unborn child is expected, a portion is reserved until the child's birth to determine their share."
        },
        {
            "tag": 18,
            "title": "Inheritance of Mass Death",
            "content": "Definition of Mass Death",
            "subContent": "Hadma (Victim of Collapse), Gharqa (Drowning Victim), and the like.\nThis refers to situations where individuals who inherit from each other die, and it is not known who died first and last. In this case, they are considered strangers to each other according to the majority of scholars except for the Hanbali school of thought.\n[Conditions for mass death:\n1. It is known that they died simultaneously, so they do not inherit from each other according to the agreement of scholars.\n2. It is known that some of them died before others and this is not forgotten, then the last one to die inherits from the one who died earlier according to the agreement of scholars.\n3. It is known that some of them died earlier than others, but it is not certain who.\n4. It is known that some of them died earlier than others, and the individuals are known, but then they are forgotten.\n5. The condition of their deaths is unknown, whether they died simultaneously or not.\nRegarding the last 3 conditions, there are differing opinions among scholars:\n1. Majority opinion of scholars: they do not inherit from each other, and their assets are given to their respective living heirs.\n2. Hanbali school of thought opinion: they inherit from the old (talid) assets owned by the deceased alongside them, not from the new (tharif) assets.]"
        },
        {
            "tag": 18,
            "title": "Inheritance of Mass Death",
            "content": "Example of Mass Death",
            "subContent": "This scenario requires careful legal consideration to determine the rightful heirs and their shares in the absence of clear succession. \n\nFor example, if a family of four dies in an accident, their estates are evaluated together to determine the distribution to remaining heirs."
        },
        {
            "tag": 19,
            "title": "Inheritance of Dzawil Arham",
            "content": "Definition of Dzawil Arham",
            "subContent": "Dzawil Arham refers to every relative entitled to inheritance, whether by fardh or ta'shib, whether they are from the roots (ushul), branches (furu'), or edges (hawasyi) of the family tree.\nThere are two methods used for the inheritance of Dzawil Arham:\n1. The method of 'Ahli Qarabah,' which is the Hanafi school of thought. This method distributes inheritance to the closest Dzawil Arham based on lineage, rank, and then strength according to the order of the branches of the family tree.\n2. The method of 'Ahli Tanzil,' followed by the Hanbali, Shafi'i, and later scholars of the Maliki school of thought. This method places Dzawil Arham in the position of intermediaries between them and the deceased.\nIn this book, we only use the calculation method of the Shafi'i school of thought and later scholars of the Maliki school of thought, which gives inheritance to the closest Dzawil Arham based on the degree of kinship without considering the branch of kinship. Additionally, it provides male children of Dzawil Arham with a double share compared to female children, plus the paternal uncle, maternal aunt, and their children. The same applies to the maternal uncle, paternal aunt, and their children, except for the children of maternal siblings, where the share for males is equal to that of females according to the consensus of all schools of thought.\nWhen do we give inheritance to Dzawil Arham?\nIf there are no heirs, whether by fardh or ta'shib, then the inheritance moves to Dzawil Arham. If one of the spouses is present, they also receive inheritance because spouses are not considered heirs according to the stronger opinion.\n1. Dzawil Arham from the roots (ushul) includes: the maternal grandfather, the father of the maternal grandmother, and so on upwards.\n2. Dzawil Arham from the branches (furu') includes: children of daughters, grandchildren of daughters, and so on downwards.\n3. Dzawil Arham from the edges (hawasyi) includes: daughters of full siblings, daughters of paternal half-siblings, children of maternal half-siblings, daughters of paternal uncles, daughters of paternal uncles from the maternal side, paternal uncles, maternal uncles absolutely, paternal aunts absolutely, maternal aunts absolutely, and all their children."
        },
        {
            "tag": 19,
            "title": "Inheritance of Dzawil Arham",
            "content": "Example of Dzawil Arham",
            "subContent": "This provision ensures that even distant family members have a right to inherit when no primary heirs are available. \n\nFor example, if an estate of IDR 400,000,000 is left without close relatives, it may be distributed to aunts and uncles."
        },
        {
            "tag": 20,
            "title": "Al-Musytarikah",
            "content": "Definition of Al-Musytarikah",
            "subContent": "Al-Musytarikah is illustrated by the gathering of the following individuals in a situation: husband, mother or grandmother, siblings from the mother's side, one or more full siblings. This case is called musytarikah because full siblings collaborate with siblings from the mother's side in 1/3. It is called 'Umariyyah because it was the decision of Umar radhiyallahu 'anhu, and this case has various names such as Al Hajariyyah, Al Yammiyyah, Al ‘Umariyyah, Al Musytarikah, and Al Musyarrakah."
        },
        {
            "tag": 20,
            "title": "Al-Musytarikah",
            "content": "Example of Al-Musytarikah",
            "subContent": "This concept addresses the complex distribution of an estate where multiple heirs have concurrent claims, ensuring fair allocation. \n\nFor instance, if an estate is worth IDR 1,000,000 and multiple heirs have equal claims, it is divided equally among them."
        },
        {
            "tag": 21,
            "title": "Al-Mu'addah",
            "content": "Definition of Al-Mu'addah",
            "subContent": "Al-Mu'addah deals with the inheritance rights of spouses in specific situations, such as when the marriage is dissolved or contested."
        },
        {
            "tag": 21,
            "title": "Al-Mu'addah",
            "content": "Example of Al-Mu'addah",
            "subContent": "This provision ensures that the surviving spouse's inheritance rights are upheld in accordance with legal and religious guidelines. \n\nFor example, if a marriage is dissolved, the spouse's entitlement may be evaluated based on the duration and circumstances of the marriage."
        },
        {
            "tag": 22,
            "title": "Al-Akdariyyah",
            "content": "Definition of Al-Akdariyyah",
            "subContent": "Al-Akdariyyah is depicted when the following individuals are involved in a situation: husband, mother, grandfather, full sister, or maternal half-sister. This case is called Al Akdariyyah because its calculation method contradicts the principles of Imam Zaid radhiyallahu 'anhu, where a full sister or maternal half-sister does not receive anything if the remaining share for the grandfather is only one-sixth."
        },
        {
            "tag": 22,
            "title": "Al-Akdariyyah",
            "content": "Example of Al-Akdariyyah",
            "subContent": "This provision ensures that justice is served in atypical inheritance scenarios through careful legal and judicial analysis. \n\nFor instance, if an estate includes unusual assets or conflicting claims, judicial interpretation may be required to determine fair distribution."
        },
        {
            "tag": 23,
            "title": "Testament",
            "content": "Definition of Testament",
            "subContent": "Linguistically, \"wasiat\" comes from \"iishal,\" which means conveying something that one intends to pass on. This is because a person making a bequest conveys the goodness of their worldly possessions to benefit their hereafter.\n\nTechnically, it refers to a social act of assigning rights (wealth) after death, albeit through estimations or predetermined means.\n\nEvidence of \"wasiat\" from the Quran: \"...after any bequests he may make or debts.\" (Quran, Surah An-Nisa, 4:11).\n\nEvidence of \"wasiat\" from the Sunnah: \"...It is not lawful for a Muslim who has something to will to stay for two nights without having his last will and testament written and kept ready with him.\" \n\nIn the early days of Islam, it was obligatory to make a bequest for both parents and relatives, as mentioned in the Quran: \"It is prescribed, when death approaches any of you, if he leaves any goods, that he make a bequest to parents and next of kin, according to reasonable usage; this is due from the Allah-fearing.\" (Quran, Surah Al-Baqarah, 2:180).\n\nLater, Allah removed the obligation of bequests through inheritance laws, but the act of making a bequest remains recommended for anyone besides the heirs, as per the majority of scholars. This is based on the Prophet's saying: \"Verily, Allah has given each person who has a right his right, and there is no bequest for an heir.\""
        },
        {
            "tag": 23,
            "title": "Testament",
            "content": "Execution of Testament",
            "subContent": "Testaments are executed according to legal statutes, ensuring that the deceased's final wishes are honored and legally binding upon their heirs."
        }
    ]
}